title: LSASS Memory Access via Sysmon
id: tl-cred-lsass-01
status: stable
description: Detects suspicious processes opening lsass.exe with read/copy access.
author: Jude Hilgendorf
references:
    - https://attack.mitre.org/techniques/T1003/001/
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 10
        TargetImage|endswith: '\lsass.exe'
        GrantedAccess|contains:
            - '0x1010'
            - '0x1410'
            - '0x1438'
            - '0x143A'
            - '0x1FFFFF'
    condition: selection
level: critical
tags:
    - attack.credential_access
    - attack.t1003.001
falsepositives:
    - Some EDR and AV agents legitimately read lsass memory.
