title: Mimikatz Command-Line Indicators
id: tl-cred-mimi-01
status: stable
description: Detects common Mimikatz commands and renamed binaries by command line.
author: Jude Hilgendorf
references:
    - https://attack.mitre.org/software/S0002/
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmd:
        CommandLine|contains:
            - 'sekurlsa::logonpasswords'
            - 'sekurlsa::pth'
            - 'kerberos::golden'
            - 'kerberos::ptt'
            - 'lsadump::sam'
            - 'lsadump::dcsync'
            - 'misc::memssp'
    selection_alias:
        CommandLine|contains:
            - 'mimikatz'
            - 'invoke-mimikatz'
    condition: 1 of selection_*
level: critical
tags:
    - attack.credential_access
    - attack.t1003
falsepositives:
    - Red-team training labs.
