title: DCSync Replication Request from Non-DC
id: tl-cred-dcsync-01
status: stable
description: 4662 with replication GUID accessed by an account that is not a domain controller.
author: Jude Hilgendorf
references:
    - https://attack.mitre.org/techniques/T1003/006/
logsource:
    category: directory_service
    product: windows
detection:
    selection:
        EventID: 4662
        Properties|contains:
            - '1131f6aa-9c07-11d1-f79f-00c04fc2dcd2'
            - '1131f6ad-9c07-11d1-f79f-00c04fc2dcd2'
            - '89e95b76-444d-4c62-991a-0facbeda640c'
    condition: selection
level: critical
tags:
    - attack.credential_access
    - attack.t1003.006
falsepositives:
    - Legitimate Azure AD Connect or DC promotion activity.
